<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use App\Models\{User,Contact,Comment,Category,Tag,Testimonial,Setting,Service,Portfolio,Package,Order,Customer,Attachment,About,Blog,Page};
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;
class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        $this->call(PermissionSeeder::class);
        $this->call(AdminSeeder::class);
        
        User::create([
            'firstname' => 'ahmed', 
            'lastname' => 'elgamal',
            'email' => 'ahmed@eraasoft.com',
            'password' => bcrypt('123456789'),
            'status'=>'1',
            'type'=>'admin',
            'code'=>mt_rand(1000000, 9999999)
        ]);
        User::create([
            'firstname' => 'hamada', 
            'lastname' => 'elgamal',
            'email' => 'hamada@eraasoft.com',
            'password' => bcrypt('123456789'),
            'status'=>'1',
            'type'=>'admin',
            'code'=>mt_rand(1000000, 9999999)
        ]);
        User::create([
            'firstname' => 'mohamed', 
            'lastname' => 'elgamal',
            'email' => 'mohamed@eraasoft.com',
            'password' => bcrypt('123456789'),
            'status'=>'1',
            'type'=>'admin',
            'code'=>mt_rand(1000000, 9999999)
        ]);
        User::create([
            'firstname' => 'elgamal', 
            'lastname' => 'elgamal',
            'email' => 'elgamal@eraasoft.com',
            'password' => bcrypt('123456789'),
            'status'=>'1',
            'type'=>'admin',
            'code'=>mt_rand(1000000, 9999999)
        ]);

        Service::create([
            'name'=>'الهوية البصرية و البراند ايدينتتى',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'إدارة مواقع التواصل الاجتماعي',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'اعلانات الفيسبوك و الانستجرام',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'انشاء المواقع الالكترونية و المتاجر',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'موبايل ابلكيشن',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'عمل اعلانات جوجل',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);


        Service::create([
            'name'=>'SEO و تحسين محركات البحث',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Service::create([
            'name'=>'تصوير منتجات',
            'slug'=>'الهوية-البصرية-البراند',
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Package::create([
            'name'=>"باقة ذهبية ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Package::create([
            'name'=>" تطبيق مخصص ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Package::create([
            'name'=>" تطبيق متجر إلكتروني ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        Package::create([
            'name'=>" تطبيق عرض محتوى ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);


        Package::create([
            'name'=>"باقة برونزية ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);


        Package::create([
            'name'=>"باقة فضية ",
            'slug'=>"باقة",
            'small_description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها',
            'description'=>'فى اوت اوف ذا بوكس تتركز أهمية الهوية الخاصة بالشركات والمؤسسات في كونها واجهة تعبر عن صورة الشركة في المقام الأول أمام عملائها ، بالإضافة إلى كونها تحتوي على المعلومات الخاصة بالشركة من حيث : الخدمات التي تقدمها الشركة ، كروت شخصية للمدير و رؤساء الأقسام ، تصميمات الأظرف وأوراق الشركة بالكامل بما يتفق مع سياساتها و أهدافها .',
            'price'=>rand(50,500),
            'user_id'=>1,
        ]);

        $services=Service::all();
        $packages=Package::all();
        foreach($packages as $package){
            foreach($services as $service){
                DB::table('package_service')->updateOrInsert(
                    ['service_id'=>$service->id,"package_id"=>$package->id],
                    [
                        "service_id"=>$service->id,
                        "package_id"=>$package->id,
                        "num_service"=>rand(1,25)
                    ],
                );
            };
        };

        
        // Contact::factory(25)->create();
        // Setting::factory(1)->create();
        // About::factory(1)->create();
        // Page::factory(2)->create();
        // User::factory(25)->hasPackages()->hasServices()->create();
        // // Attachment::factory(5)->create();
        // // // $services=Package::all();
        // // // Package::all()->each(function ($package) use ($services) { 
        // // //     $package->services()->attach(
        // // //         $services->random(rand(1, 10))->pluck('id')->toArray()
        // // //     ); 
        // // // });
    }
}
