<?php


return[

    //pages lang
    "home"=>"الرئيسية",
    "service"=>"الخدمات",
    "package"=>"الباقات",
    "about-us"=>"معلومات عنا",
    "contact"=>"اتصل بنا",
    "Portfolio"=>"اعمالنا",
    "blog"=>"مقالات",
    "Privacy-Policy"=>"سياسة الخصوصية",
    "Terms-&-Condition"=>"الشروط والأحكام",
    "Order_Details"=>"تفاصيل الطلب",
    "profile"=>"الملف الشخصي",
    "blog_details"=>"تفاصيل المدونة",
    "package_details"=>"تفاصيل الباقه",
    "portfolio_details"=>"تفاصيل اعمالنا",
    "service_details"=>"تفاصيل الخدمة",
    //banner
    "content_banner1"=>"البحث عن أقوى",
    "content_banner2"=>"تسويق رقمي",
    "content_banner3"=>"خدمة",
    "content_banner_desc"=>"ابدأ العمل مع شركة توفر كل ما تحتاجه لزيادة الوعي وزيادة حركة المرور والتواصل مع العملاء.",

    //Features
    'section_features_title' => 'مميزاتنا',
    'section_features_subtitle' => '  مايميزنا هو الخبرة و المهارة فنحن نمتلك فريق من المختصين ذوي الخبرة في مجال التسويق الرقمي بالسوق السعودي يمكنهم مساعدتك لتحقيق النتائج التي ترغب بها .',
    
    'section_features_1_title' => 'الوصول للعملاء المحتملين',
    'section_features_1_subtitle' => 'نحرص دوما على الوصول إلى عملاء يتناسبون مع أهدافك.',

    'section_features_2_title' => 'بناء الثقة في علامتك التجارية',
    'section_features_2_subtitle' => 'نعمل على بناء هوية تجارية مميزة خاصة بك تكسبك ثقة العملاء وولاءهم.',

    'section_features_3_title' => 'تحليل الأعمال و المنافسين ',
    'section_features_3_subtitle' => 'نحرص على تحليل منافسيك و تحليل السوق الذي تقدم فيه خدماتك و منتجاتك.',

    //What We do
    'section_works_title' => 'مالذي نقدمه',
    'section_works_subtitle' => 'باحترافية وخبرة فائقة، نقدم حلولًا متكاملة لتعزيز هوية العلامة التجارية وتحقيق نجاح حملات التسويق الإبداعية. نعتمد على الابتكار في تقديم الحلول التي تلبي احتياجات العملاء وتجذب بفاعلية الجمهور المستهدف.',
    
    'section_works_1_title' => ' خطط واستراتيجيات التسويق الرقمي',
    'section_works_1_subtitle' => 'تحليل وتنفيذ استراتيجيات تسويقية مبتكرة تعتمد على الوسائل الرقمية للوصول إلى الجمهور المستهدف.',

    'section_works_2_title' => 'الاعلانات الرقمية',
    'section_works_2_subtitle' => 'تصميم وتنفيذ حملات إعلانية مبتكرة وفعالة لتحقيق أهداف التسويق وتعزيز مكانة العلامة التجارية.',

    'section_works_3_title' => 'التصاميم الإبداعية',
    'section_works_3_subtitle' => 'تقديم أفكار فريدة وجذابة في تصميم المحتوى البصري لجذب انتباه الجمهور وتحقيق تأثير إيجابي وقوي.',

    'section_works_4_title' => 'تحسين محركات البحث',
    'section_works_4_subtitle' => 'تحسين مركز موقعك على نتائج محركات البحث الرئيسية لزيادة الحركة المرورية وزيادة التحويلات.',

    //Services
    'section_services_title' => 'خدماتنا',
    'section_services_subtitle' => 'احصل على خدمات متكاملة ونتائج مذهلة بسرعة فائقة مع احترافنا وتفانينا في مجال التسويق الإلكتروني!',
    
    //Packages
    'section_packages_title' => 'باقاتنا',
    'section_packages_subtitle' => 'لكي يبرز نشاطك التجاري لا بد من تقديم محتوى تفاعلي على منصات التواصل الاجتماعي انضم لعائلتنا الآن و اختر واحدة من باقاتنا المميزة و شاهد أعمالك تزدهر.',
    
    //Contact
    'section_contact_title' => 'تواصل معنا',
    'section_contact_subtitle' => 'احجز موعدك الآن مع خبراء التسويق الرقمي في ايكويك لتعرف المزيد عن خدماتنا و كيف يمكننا مساعدتك في تحقيق أهدافك. 
<br>
سنقوم بالرد عليكم خلال مدة لا تتجاوز 24 ساعة. ',
    
    //Modals
    'modal_no_account_title' => 'ليس لديك حساب',
    'modal_no_account_subtitle' => 'بالضغط على "تأكيد"، سيتم تحويلك إلى صفحة الشراء.',

    'modal_confirm_order_title' => 'أنت على وشط طلب خدمة الآن',
    'modal_confirm_order_subtitle' => 'بالضغط على "تأكيد"، سيتم تحويلك إلى صفحة الشراء.',

    'modal_confirm_order_2_title' => 'أنت على وشط طلب باقة الآن',
    'modal_confirm_order_2_subtitle' => 'بالضغط على "تأكيد"، سيتم تحويلك إلى صفحة الشراء.',

    //Footer 
    "foo_about_title"=>"انضم الينا",
    "foo_about_subtitle"=>"ايكويك شركة تسويق الكتروني تقدم حلول التسويق الالكتروني , تساعد الشركات و مؤسسات الأعمال على زيادة الوعي بالعلامة التجارية و الوصول إلى الجمهور المستهدف و فقا لخطط تسويقية و استراتيجيات فعالة تناسب نشاط أعمالك. ",
    "foo_links"=>"روابط الموقع",
    "foo_pages"=>"صفحات الموقع",
    "foo_contact"=>"اتصل بنا",
    "foo_copyright"=>"© 2023 اكويك. جميع الحقوق محفوظة.",

    //auth
    "welcome"=>"مرحبًا بعودتك",
    "Your_account_is_Inactive"=>"حسابك غير نشط",
    "password_or_email"=>"كلمة المرور أو البريد الإلكتروني غير صحيح",
    "Happy_customer"=>"عميل سعيد",
    "Awards"=>"الجوائز",
    "Success_Rate"=>"معدل النجاح",
    "Project_Done"=>"المشاريع",
    "SUCCESS_STORIES"=>"قصص نجاح",
    "deasc_portfolio"=>"العميل مهم جدا ، العميل سيتبعه. لأن المحترم نفسه سيُطارد بالسم.",
    "text_service"=>"لوريم إيبسوم هو ببساطة نص شكلي يستخدم في صناعة الطباعة والتنضيد.",
    "Choose_Your_Package"=>"اختر باقتك",
    "text_package"=>"هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها.",
    "Login"=>"تسجيل الدخول",
    "email"=>"البريد الإلكتروني",
    "password"=>"كلمه المرور",
    "Forgot_Password"=>"هل نسيت كلمة المرور؟",
    "Remember_me"=>"ذكرنى",
    "Sign_In"=>"تسجيل الدخول",
    "Not_Account"=>"لا يوجد لديك حساب",
    "Sign_Up"=>"سجل الان",
    "Register"=>"تسجيل",
    "name"=>"الاسم",
    "confirm_password"=>"تأكيد كلمة المرور",
    "have_account"=>"لديك حساب",
    "Contact_info"=>"معلومات الاتصال",
    "Address"=>"العنوان",
    "Phone"=>"رقم التليفون",
    "Logout"=>"تسجيل خروج",
    "Follow_Us"=>"تابعنا",
    "NewsLetter"=>"النشرة الإخبارية",
    "Subscribe"=>"اشترك الان",
    "Copyright"=>"حقوق النشر 2023 | كل الحقوق محفوظة",
    "text_testimonial"=>"يمكنك أن ترى آراء عملائنا ماذا تقول؟",
    "testimonial"=>"اراء عملائنا",
    "title_blog"=>"اقرأ آخر أخبارنا",
    "text_blog"=>"على عكس الاعتقاد السائد ، فإنه ليس مجرد نص عشوائي. لها جذور في قطعة من الأدب اللاتيني الكلاسيكي من 45 قبل الميلاد",
    //profile
    "Edit_profile"=>"تعديل الملف الشخصي",
    "Edit"=>"تعديل",
    "Change_Password"=>"تغيير كلمة المرور",
    "Old_Password"=>"كلمة المرور القديمة",
    "New_Password"=>"كلمة مرور جديدة",
    "Change"=>"تغيير",
    "details"=>"المزيد من التفاصيل",
    //contact
    "Send_Message"=>"أرسل رسالة",
    "message"=>"رسالة",
    "title_contact"=>"ابقى على تواصل",
    "Read_More"=>"قراءة المزيد",
    "firstname"=>"الاسم الأول",
    "lastname"=>"الاسم الاخير",
    "send_success"=>"تم الإرسال",
    "advantages"=>"مميزاتنا"
];